#  tuple - кортеж ()
#  list  - список []
#  dict  - словарь {}
# *args - распоковка списка *kwargs - распоковка словаря
# Чтобы импортировать модуль нужно добавить папку/файл в sources root
# max() - максимальный элемент
# min() - минимальный элемент
# sorted() - отсортированный список
# sum() - сумма элементов списка
# zip() - попарная компоновка элементов двух списков
# all() - True если ВСЕ элементы списка/множества True
# any() - True если ХОТЯ БЫ ОДИН элемент списка True
# dir() - список всех аттрибутов обьекта
# help() - встроенная помощь по функции/обьекту
# id() - внутренний идентификатор обьекта
# hash() - значение хэша для обьекта. Что такое хэш-функции см https://goo.gl/gZLM4o
# isinstance() - является ли обьект обьектом данного класса
# type() - тип(КЛАСС) обьекта
# open() - открыть файл на файловой системе
# globals() - встроенная функция, которая возвращает словарь глобальных имен
# locals() - встроенная функция, которая возвращает словарь локального пространства имен
# _sorted_keys = None Подчерк перед переменной говорит о том внутреняя переменная которую использовать на прямую не надо